## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_network_security_group.app_nsg will be created
  + resource "azurerm_network_security_group" "app_nsg" {
      + id                  = (known after apply)
      + location            = "canadacentral"
      + name                = "chha0038-app-nsg"
      + resource_group_name = "chha0038-app-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "env" = "lab12"
        }
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "canadacentral"
      + name     = "chha0038-app-rg"
      + tags     = {
          + "app"   = "tf-app"
          + "env"   = "lab12"
          + "owner" = "chha0038"
        }
    }

  # azurerm_subnet.subnet will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.10.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "app-subnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "chha0038-app-rg"
      + virtual_network_name                           = "chha0038-vnet"
    }

  # azurerm_subnet_network_security_group_association.app_subnet_nsg will be created
  + resource "azurerm_subnet_network_security_group_association" "app_subnet_nsg" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.10.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "canadacentral"
      + name                = "chha0038-vnet"
      + resource_group_name = "chha0038-app-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "env" = "lab12"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + resource_group_name = "chha0038-app-rg"
  + subnet_name         = "app-subnet"
  + vnet_name           = "chha0038-vnet"
```
</details>